src/DataProcessors/ЗаполнениеКалендаря/ЗаполнениеКалендаря.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:DataProcessor>
  <name>ЗаполнениеКалендаря</name>
</mdclass:DataProcessor>

src/InformationRegisters/Календарь/Календарь.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>Календарь</name>
  <resources>
    <name>Признак</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>1</precision>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>КолЧасов</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>2</precision>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>Дата</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </dimensions>
  <dimensions>
    <name>График</name>
    <type>
      <types>CatalogRef.ГрафикиРаботы</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Подразделение</name>
    <type>
      <types>CatalogRef.Подразделения</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

src/DataProcessors/ЗаполнениеКалендаря/Forms/Форма/Module.bsl
&НаСервере
Процедура ЗаполнитьНаСервере()
	ТекДата = Период.ДатаНачала;
	НачатьТранзакцию();
	
	КолСтрок = ШаблонЗаполнения.Количество();
	
	Пока ТекДата <= Период.ДатаОкончания Цикл
		
		Индекс = (ТекДата - Период.ДатаНачала) / 86400 % КолСтрок;
		
		Запись = РегистрыСведений.Календарь.СоздатьМенеджерЗаписи();
		Запись.Дата = ТекДата;
		Запись.Признак = ШаблонЗаполнения [Индекс].Признак ;
		Запись.Подразделение = Подразделение;
		Запись.КолЧасов = ШаблонЗаполнения [Индекс].КолЧасов;
		Запись.График = График;
		Запись.Записать();
		
		//Запись.Удалить();
		ТекДата = ТекДата + 86400;
		
	КонецЦикла; 
	
	Если ТранзакцияАктивна() Тогда
		ЗафиксироватьТранзакцию();
	Иначе
		Сообщить(ОписаниеОшибки());
	КонецЕсли; 
КонецПроцедуры

&НаКлиенте
Процедура Заполнить(Команда)
	ЗаполнитьНаСервере();
	ПоказатьОповещениеПользователя("Все ок");
КонецПроцедуры
